"""
기본적으로 a: str 숫자열, b: 최대교환횟수 int라는 args가 들어옴
종료조건은 a가 가장 큰 수가 될 때 까지 교환
큰 수가 되게 교환을 마쳤는데 b가 0이 아니면 가장 작은 수 두 개를 남은 수 만큼 교환
15개의 테스트케이스, 스택메모리는 1mb, 시간은 30초
우선 정렬 원리는 가장 큰 수와 작은 수를 서로 직접 교환하는 방식
스캔을 많이 하더라도 적은 횟수의 교환으로 큰 수를 만들고
남은 횟수만큼 작은 숫자 2개 정해서 무한 교환(사실 홀수면 교환하고 짝수면 그냥 교환하지 않게 해도 됨)
근데 언제가 가장 큰 값인지 알지? 그냥 sort한 값하고 비교해서 같으면 최대 수 찾기는 그만 두자
루프마다 할 일
~큰 수 찾고, 작은 수 찾아서 둘 교환 시키기가 가장 횟수는 적음~
~큰 수, 작은 수 -> 두번째 큰수, 작은수 -> ... sort 값과 같으면 done~
틀렸음. 그냥 큰 수를 가장 오른쪽에 보내는 방식이 맞음. 예제에서도 8하고 3을 바꾸지 2랑 바꾸지 않음
즉 최댓값을 구해서 오른쪽에 밀어넣고 [i+1:]으로 구간을 좁혀가면서 찾아야 함
복제본pop, answer = 숫자바꾼원본복제 -> 복제본pop, answer = 숫자바꾼answer 복제 
1111
333111
12345
354364


## 로직
가장 큰수 탐색
    가장 작은 수 찾은 다음 위치 바꾸기
    sort한 값과 비교
    같으면서 교환 횟수가 남아 있으면
        교환 횟수가 홀수면
            마지막 끝 두 자리만 바꾸기
        교환 횟수가 짝수면
            continue
    같으면서 교환 횟수가 == 0이면?
        return 정렬된최종값
## 변수
a = 문자열
b = 변경횟수
sorted_max = int("".join(sorted(a)))

### 회고
우선 문제가 그리디가 아닌 완전탐색에 가까운 문제였음
이걸 눈치챌 몇 가지 방법이 있었는데, 우선 시간이 많이 넉넉했다는 점
그리고 예시의 정렬에 단순한 규칙이 없었다는 점(3하고 네번째8, 2하고 마지막 8 -> 규칙이 단순 명료하지 않음)
최대 자릿수는 6자리, 최대 교환 횟수는 10번으로
최악으로 가정해도 각 자릿수가 바꾸는 모든 경우의 수는 6! = 120*6 = 720가지 밖에 안 되며 그마저도 최대 교환 횟수가 10번임
720 * C(6,2) = 720 * 15 = 10800, 미리 정렬되어 있고 남은 횟수가 10번이라 가정해도 10800 * 10 = 10만 8천
python으로 모든 테스트 케이스 10을 돌려도 108만회 연산으로 1초에 1000만회 남짓 연산 가능한 python에게 넉넉한 시간임
즉 그냥 모든 상태를 계산하고 최댓값을 뽑아도 크게 문제가 없는 문제임
결론: 사용할 알고리즘을 먼저 알려면 우선 제약 사항부터 보자
"""

import sys
sys.stdin = open("./input.txt", "r")

def solve(s: str, k: int) -> str:
    """
    Args:
        s (str): 숫자판 문자열
        k (int): 정확히 교환해야 하는 횟수

    Returns:
        str: 정확히 k번 교환했을 때 만들 수 있는 가장 큰 숫자 문자열
    """
    level: set[str] = {s}

    for _ in range(k):
        nxt: set[str] = set()
        for cur in level:
            chars: list[str] = list(cur)
            for i in range(len(chars)):
                for j in range(i + 1, len(chars)):
                    chars[i], chars[j] = chars[j], chars[i]
                    nxt.add("".join(chars))
                    chars[i], chars[j] = chars[j], chars[i]  # 원상복구
        level = nxt

    return max(level)


T: int = int(input())
for test_case in range(1, T + 1):
    a, b = input().split()
    print(f"#{test_case} {solve(a, int(b))}")